# coding: utf-8


import pandas as pd


attraction_id = {
    # 110: 'ﾋﾞｯｸﾞｻﾝﾀﾞｰﾏｳﾝﾃﾝ',
    # 163: 'ﾓﾝｽﾀｰｽﾞ･ｲﾝｸ“ﾗｲﾄﾞ＆ｺﾞｰｼｰｸ！”',
    # 123: 'ﾌﾟｰさんのﾊﾆｰﾊﾝﾄ',
    # 112: 'ｽﾌﾟﾗｯｼｭﾏｳﾝﾃﾝ',
    # 392: 'ｽﾃｨｯﾁ･ｴﾝｶｳﾝﾀｰ',
    # 126: 'ﾐｯｷｰの家とﾐｰﾄ･ﾐｯｷｰ',
    # 134: 'ﾊﾞｽﾞ･ﾗｲﾄｲﾔｰのｱｽﾄﾛﾌﾞﾗｽﾀｰ',
    # 366: 'ｼﾞｬﾝｸﾞﾙｸﾙｰｽﾞ：ﾜｲﾙﾄﾞﾗｲﾌ･ｴｸｽﾍﾟﾃﾞｨｼｮﾝ',
    # 133: 'ｽﾍﾟｰｽ･ﾏｳﾝﾃﾝ',
    # 132: 'ｽﾀｰ･ﾂｱｰｽﾞ：ｻﾞ･ｱﾄﾞﾍﾞﾝﾁｬｰｽﾞ･ｺﾝﾃｨﾆｭｰ',
    # 120: 'ﾎｰﾝﾃｯﾄﾞﾏﾝｼｮﾝ',
    # 102: 'ｶﾘﾌﾞの海賊',
    # 116: 'ﾐｯｷｰのﾌｨﾙﾊｰﾏｼﾞｯｸ',
    # 121: 'ｲｯﾂ･ｱ･ｽﾓｰﾙﾜｰﾙﾄﾞ',
    # 114: 'ﾋﾟｰﾀｰﾊﾟﾝ空の旅',
    # 167: 'ｼﾝﾃﾞﾚﾗのﾌｪｱﾘｰﾃｲﾙ･ﾎｰﾙ',
    # 128: 'ｶﾞｼﾞｪｯﾄのｺﾞｰｺｰｽﾀｰ',
    # 124: 'ﾛｼﾞｬｰﾗﾋﾞｯﾄのｶｰﾄｩｰﾝｽﾋﾟﾝ',
    # 137: 'ｸﾞﾗﾝﾄﾞｻｰｷｯﾄ･ﾚｰｽｳｪｲ',
    # 136: 'ｽﾀｰｼﾞｪｯﾄ',
    # 106: '魅惑のﾁｷﾙｰﾑ：ｽﾃｨｯﾁ･ﾌﾟﾚｾﾞﾝﾂ“ｱﾛﾊ･ｴ･ｺﾓ･ﾏｲ！”',
    # 118: '空飛ぶﾀﾞﾝﾎﾞ',
    # 115: '白雪姫と七人のこびと',
    # 174: 'ｸﾞｰﾌｨｰのﾍﾟｲﾝﾄ＆ﾌﾟﾚｲﾊｳｽ',
    # 117: 'ﾋﾟﾉｷｵの冒険旅行',
    # 122: 'ｱﾘｽのﾃｨｰﾊﾟｰﾃｨｰ',
    # 107: 'ｳｴｽﾀﾝﾗﾝﾄﾞ･ｼｭｰﾃｨﾝｸﾞｷﾞｬﾗﾘｰ',
    109: '蒸気船マークトウェイン号',
    125: 'ミニーの家',
    113: 'ビーバーブラザーズのカヌー探険',
    129: 'ドナルドのボート',
    111: 'トムソーヤ島いかだ',
    119: 'キャッスルカルーセル',
    108: 'カントリーベア・シアター',
    127: 'チップとデールのツリーハウス',
    101: 'オムニバス',
    105: 'スイスファミリー・ツリーハウス'
}


import unicodedata


def norm(string):
    return unicodedata.normalize('NFKC', unicode(string))


def make_csv():
    a = pd.DataFrame([[k, v] for k, v in attraction_id.items()], columns=['site_id', 'name'])
    a = a.sort_values(by='site_id')
    a['id'] = [i for i in range(len(a))]
    a['name'] = a['name'].apply(norm)
    a = a.reindex(columns=['id', 'site_id', 'name'])
    a.to_csv('アトラクションID_ランド.csv', index=False)


make_csv()

